<?php


/**
 * ***********  Расширения PHP   **********
*/


/**
 * php -m - список расширений
 *
 * Список расширений находится в каталоге ext
 *
 * Дополнительная информация о динамических расширений
 * находится в файле snapshot.txt корне каталога PHP.
 */

/**
 * Пример установки curl
 * apt-get install php7-curl
 */


/**
 * Параметры языка PHP
 *
 * engine           - php-скрипт под управлением WEB-сервера
 * precision        - кол-во знаков под дробные числа
 * output_buffering - автоматическая буферизация. Кол-во байтов для удаления
 * short_open_tag   - включает использование коротких тегов <? ?>
 */


/**
 * Ограничение ресурсов
 *
 * max_execution_time - max время на выполнения скрипта. По умолчанию 30с.
 * max_input_time - max время на разбор GET-, POST-данных и загруженных файлов. По умолчанию 60с.
 * memory_limit - max кол-во памяти, выделяемой под один экземпляр скрипта.
 */


/**
 * Загрузка файлов
 *
 * file_uploads - on или off загрузку файлов по протоколу HTTP.
 * uploads_tmp_dir - путь к каталогу временных файлов
 * uploads_max_filesize - max размер загружаемого на сервер файла
 * post_max_size - max размер POST-данных
 */

